In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
csv_file = "../Resources/norway_new_car_sales_by_model.csv"
sales_df = pd.read_csv(csv_file ,encoding='latin1')
sales_df

      Year  Month         Make              Model  Quantity   Pct
0     2007      1  Volkswagen   Volkswagen Passat      1267  10.0
1     2007      1      Toyota         Toyota Rav4       819   6.5
2     2007      1      Toyota      Toyota Avensis       787   6.2
3     2007      1  Volkswagen     Volkswagen Golf       720   5.7
4     2007      1      Toyota      Toyota Corolla       691   5.4
...    ...    ...          ...                ...       ...   ...
2689  2017      1     Peugeot        Peugeot 3008       216   1.7
2690  2017      1         Kia            Kia Niro       214   1.6
2691  2017      1       Skoda        Skoda Superb       205   1.6
2692  2017      1         BMW         BMW 2-serie       202   1.5
2693  2017      1       Volvo           Volvo V90       202   1.5

[2694 rows x 6 columns]

In [3]:
 sales_df["Model"] = sales_df["Model"].str.rsplit(' ', 1).str.get(1)

In [4]:
sales_df["id"] = sales_df.index
del sales_df['Pct']

In [5]:
sales_df['Make'] = sales_df['Make'].str.lstrip()

In [6]:
sales_df

      Year  Month         Make    Model  Quantity    id
0     2007      1  Volkswagen    Passat      1267     0
1     2007      1      Toyota      Rav4       819     1
2     2007      1      Toyota   Avensis       787     2
3     2007      1  Volkswagen      Golf       720     3
4     2007      1      Toyota   Corolla       691     4
...    ...    ...          ...      ...       ...   ...
2689  2017      1     Peugeot      3008       216  2689
2690  2017      1         Kia      Niro       214  2690
2691  2017      1       Skoda    Superb       205  2691
2692  2017      1         BMW   2-serie       202  2692
2693  2017      1       Volvo       V90       202  2693

[2694 rows x 6 columns]

In [7]:
sales_df_yr = sales_df.groupby(["Year","Make", "Model"])[["Quantity"]].sum()

In [8]:
sales_df_yr.reset_index(inplace=True)

In [9]:
sales_df_yr

     Year         Make    Model  Quantity
0    2007        Audi        A3      1767
1    2007        Audi        A4      2369
2    2007         BMW   3-serie       332
3    2007        Ford     Focus      3038
4    2007        Ford    Mondeo      2220
..    ...          ...      ...       ...
372  2017  Volkswagen    Passat       515
373  2017       Volvo       V40       220
374  2017       Volvo       V60       248
375  2017       Volvo       V90       202
376  2017       Volvo      XC90       411

[377 rows x 4 columns]

In [10]:
conds = [sales_df_yr['Quantity'] >= 1157, ((sales_df_yr['Quantity'] > 591) & (sales_df_yr['Quantity'] < 1157)), sales_df_yr['Quantity'] <= 591]
     
choices = ['High', 'Medium', 'Low']

sales_df_yr['Sales_Rating'] = np.select(conds, choices)



# np.select["High", "Medium" , "Low"]

In [12]:
sales_df_yr = sales_df_yr.rename(columns = {'Year':'year', 'Make':'make', 'Model':'model', 'Quantity':'quantity', 'Sales_Rating':'sales_rating', })

In [13]:
sales_df_yr

     year         make    model  quantity sales_rating
0    2007        Audi        A3      1767         High
1    2007        Audi        A4      2369         High
2    2007         BMW   3-serie       332          Low
3    2007        Ford     Focus      3038         High
4    2007        Ford    Mondeo      2220         High
..    ...          ...      ...       ...          ...
372  2017  Volkswagen    Passat       515          Low
373  2017       Volvo       V40       220          Low
374  2017       Volvo       V60       248          Low
375  2017       Volvo       V90       202          Low
376  2017       Volvo      XC90       411          Low

[377 rows x 5 columns]

In [14]:
engine = create_engine("postgresql://postgres:7924@localhost:5432/ETL_proj")
conn = engine.connect

In [15]:
engine.table_names()

['sales_df_yr', 'fueleconomy']

In [16]:
sales_df_yr.to_sql(name='sales_df_yr', con=engine, if_exists='append', index=False)